import { motion, Variants } from "framer-motion"

export default function DocumentIllustrationCard() {
  const DELAY = 0.05
  const parentVariant: Variants = {
    initial: { y: 180, opacity: 0 },
    whileInView: {
      y: 0, opacity: 1, transition: {
        type: "spring",
        bounce: 0.1,
        duration: 0.8, staggerChildren: DELAY
      }
    },
  };
  const childrenVariant: Variants = {
    initial: { opacity: 0, y: 20 },
    whileInView: {
      y: 0, opacity: 1, transition: {
        duration: 0.6,
        ease: [0.22, 1, 0.36, 1],
      }
    }
  };

  const transparentVariant: Variants = {
    initial: { opacity: 0, y: 20 },
    whileInView: {
      y: 0, opacity: 0.2, transition: {
        duration: 0.6,
        ease: [0.22, 1, 0.36, 1],
      }
    }
  };
  return (
    <motion.svg
      width="494"
      height="281"
      viewBox="0 0 494 281"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <defs>
        <clipPath id="docClip" clipPathUnits="userSpaceOnUse">
          <rect width="494" height="280" rx="50" />
        </clipPath>
      </defs>

      {/* Fond */}
      <rect width="494" height="280" rx="50" fill="#6B3B09" />

      <g clipPath="url(#docClip)">
        <motion.g
          variants={parentVariant}
          initial="initial"
          whileInView="whileInView"
          viewport={{ once: true }}>
          {/* Fond arrière */}
          <motion.path
            d="M60.2595 144.017C60.2595 135.139 67.4888 127.958 76.3672 128.018L415.845 130.302C424.639 130.361 431.737 137.507 431.737 146.302L431.737 280.409H60.2595L60.2595 144.017Z"
            fill="#9C846D" />

          {/* Document incliné */}
          <motion.path
            d="M77.5117 99.9397C78.5257 84.509 91.8567 72.822 107.287 73.836L404.615 93.3742C420.045 94.3882 431.732 107.719 430.718 123.15L420.62 276.819L67.4137 253.608L77.5117 99.9397Z"
            fill="#EBE0D6"
            variants={childrenVariant}

          />

          {/* Carte principale */}
          <motion.path
            d="M98 98.9092H395.969C411.156 98.9093 423.469 111.221 423.469 126.409V279.909H70.5V126.409C70.5 111.221 82.8122 98.9092 98 98.9092Z"
            fill="#EBE0D6"
            stroke="white"
            variants={childrenVariant}

          />

          {/* Lignes */}
          {[
            { x: 210, y: 115.409, w: 196 },
            { x: 211, y: 146.409, w: 32 },
            { x: 251, y: 146.409, w: 155 },
            { x: 210, y: 177.409, w: 78 },
            { x: 291, y: 177.409, w: 115 },
            { x: 211, y: 208.409, w: 151 },
            { x: 89, y: 239.409, w: 69 },
            { x: 165, y: 239.409, w: 161 },
            { x: 333, y: 239.409, w: 73 },
            { x: 367, y: 208.409, w: 39 },
          ].map((rect, i) => (
            <motion.rect
              key={i}
              x={rect.x}
              y={rect.y}
              width={rect.w}
              height="24"
              rx="12"
              fill="#9C846D"
              variants={transparentVariant}
            />
          ))}

          {/* Icône balance */}
          <motion.g
            variants={childrenVariant}
          >
            <path d="M148.583 146.127C153.329 144.452 157.126 140.655 158.801 135.909H176.5L159.75 174.993C159.75 184.261 168.516 191.743 179.292 191.743C190.068 191.743 198.833 184.261 198.833 174.993L182.083 135.909H187.667C190.75 135.909 193.25 133.41 193.25 130.326C193.25 127.242 190.75 124.743 187.667 124.743H158.801C156.512 118.21 150.314 113.576 143 113.576C135.686 113.576 129.488 118.21 127.199 124.743H98.3334C95.2498 124.743 92.7501 127.242 92.7501 130.326C92.7501 133.41 95.2498 135.909 98.3334 135.909H103.917L87.1667 174.993C87.1667 184.261 95.9326 191.743 106.708 191.743C117.484 191.743 126.25 184.261 126.25 174.993L109.5 135.909H127.199C128.874 140.655 132.671 144.452 137.417 146.127V190.774C137.417 200.56 129.484 208.493 119.698 208.493H92.7501C89.6665 208.493 87.1667 210.992 87.1667 214.076C87.1667 217.16 89.6665 219.659 92.7501 219.659H193.25C196.334 219.659 198.833 217.16 198.833 214.076C198.833 210.992 196.334 208.493 193.25 208.493H166.302C156.516 208.493 148.583 200.56 148.583 190.774V146.127ZM189.07 173.449C189.384 174.179 188.848 174.993 188.053 174.993H170.531C169.736 174.993 169.2 174.179 169.513 173.449L179.292 150.649L189.07 173.449ZM116.487 173.449C116.8 174.179 116.264 174.993 115.469 174.993H97.9476C97.1524 174.993 96.6163 174.179 96.9298 173.449L106.708 150.649L116.487 173.449ZM143 135.909C139.929 135.909 137.417 133.397 137.417 130.326C137.417 127.255 139.929 124.743 143 124.743C146.071 124.743 148.583 127.255 148.583 130.326C148.583 133.397 146.071 135.909 143 135.909Z" fill="#9C846D" />

          </motion.g>
          {/* Bottom */}
          <motion.path
            d="M54.3179 199.63C53.6069 190.34 60.9536 182.409 70.2713 182.409H234C240.627 182.409 246 187.782 246 194.409C246 201.037 251.373 206.409 258 206.409H423.192C432.88 206.409 440.346 214.951 439.048 224.552L431.5 280.409H60.5L54.3179 199.63Z"
            fill="#9C846D"
            variants={parentVariant}
          />
        </motion.g>
      </g>
    </motion.svg>
  )
}